### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [3]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
purchase_data["SN"].nunique()

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
number_of_unique_items=purchase_data["Item Name"].nunique()
number_of_unique_items

179

In [6]:
average_price=purchase_data["Price"].mean()
average_price

3.050987179487176

In [7]:
number_of_purchase=purchase_data["Purchase ID"].count()
number_of_purchase

780

In [8]:
total_revenue=purchase_data["Price"].sum()
total_revenue

2379.77

In [9]:
summary_purchase_df=pd.DataFrame({"Number_of_Unique_Items" : number_of_unique_items,
                                  "Average_Price" : [average_price],
                                  "Number_of_Purchase": [number_of_purchase],
                                  "Total_Revenue": [total_revenue]})
summary_purchase_df['Total_Revenue'] = summary_purchase_df['Total_Revenue'].map("${:,.2f}".format)
summary_purchase_df['Average_Price'] = summary_purchase_df['Average_Price'].map("${:,.2f}".format)

In [10]:
summary_purchase_df.head()

   Number_of_Unique_Items Average_Price  Number_of_Purchase Total_Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
purchase_data.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [12]:
purchase_data["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [13]:
male_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Male"]

In [14]:
male_player_count=len(male_player_count_df["Gender"])

In [15]:
male_player_count

652

In [16]:
male_percent=((male_player_count/purchase_data["Gender"].count())*100).round(2)

In [17]:
male_percent

83.59

FEMALE

In [18]:
female_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Female"]

In [19]:
female_player_count=len(female_player_count_df["Gender"])

In [20]:
female_player_count

113

In [21]:
female_percent=((female_player_count/purchase_data["Gender"].count())*100).round(2)

In [22]:
female_percent

14.49

Other / Non-Disclosed

In [23]:
other_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed"]

In [24]:
other_player_count=len(other_player_count_df["Gender"])

In [25]:
other_player_count

15

In [26]:
other_percent=((other_player_count/purchase_data["Gender"].count())*100).round(2)

In [27]:
other_percent

1.92

In [28]:
total_gender_df=pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"],
                             "Count": [male_player_count, female_player_count, other_player_count],
                             "% Count": [male_percent, female_percent, other_percent]})
total_gender_df['% Count'] = total_gender_df['% Count'].map("{:,.2f}%".format)

In [29]:
total_gender_df

                  Gender  Count % Count
0                   Male    652  83.59%
1                 Female    113  14.49%
2  Other / Non-Disclosed     15   1.92%

In [30]:
cleaner_gender_df=total_gender_df.set_index("Gender")

In [31]:
cleaner_gender_df

                       Count % Count
Gender
Male                     652  83.59%
Female                   113  14.49%
Other / Non-Disclosed     15   1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [32]:
groupby_purchase_data_df=purchase_data.groupby(["Gender"])

In [33]:
purchase_data.head(3)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88

In [34]:
groupby_purchase_data_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [35]:
new_groupby_purchase_data_df=pd.DataFrame(groupby_purchase_data_df["Price"].mean())

In [36]:
new_groupby_purchase_data_df["Price"].mean()

3.188953870097905

In [37]:
new_groupby_purchase_data_df

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [38]:
total_count=pd.DataFrame(groupby_purchase_data_df["Purchase ID"].count())

In [39]:
new_groupby_purchase_data_df["Purchase Count"]=total_count

In [40]:
new_groupby_purchase_data_df

                          Price  Purchase Count
Gender
Female                 3.203009             113
Male                   3.017853             652
Other / Non-Disclosed  3.346000              15

In [41]:
total_purchase_value=pd.DataFrame(groupby_purchase_data_df["Price"].sum())
new_groupby_purchase_data_df["Total Purchase Value"]=total_purchase_value
new_groupby_purchase_data_df

                          Price  Purchase Count  Total Purchase Value
Gender
Female                 3.203009             113                361.94
Male                   3.017853             652               1967.64
Other / Non-Disclosed  3.346000              15                 50.19

In [42]:
new_groupby_purchase_data_df[["Purchase Count", "Price", "Total Purchase Value"]]

                       Purchase Count     Price  Total Purchase Value
Gender
Female                            113  3.203009                361.94
Male                              652  3.017853               1967.64
Other / Non-Disclosed              15  3.346000                 50.19

# last missing value

In [43]:
new_groupby_purchase_data_df.rename(columns={"Price": "Average Purchase Price"})

,Average Purchase Price,Purchase Count,Total Purchase Value
Gender,,,
Female,3.203009,113,361.94
Male,3.017853,652,1967.64
Other / Non-Disclosed,3.346000,15,50.19

In [44]:
groupby_gender_and_sn_df=purchase_data.groupby(["Gender","SN"])

In [45]:
groupby_gender_and_sn_df.mean()

                                     Purchase ID   Age  Item ID  Price
Gender                SN
Female                Adastirin33          142.0  35.0    175.0  4.480
                      Aerithllora36        426.0  29.0    117.5  4.320
                      Aethedru70           775.0  21.0     60.0  3.540
                      Aidain51             516.0  39.0     35.0  3.450
                      Aiduesu86            429.0  22.0    179.0  4.480
...                                          ...   ...      ...    ...
Other / Non-Disclosed Lirtim36             401.0  15.0     46.0  1.330
                      Maluncil97           589.0  25.0    126.5  2.640
                      Rairith81            350.0  15.0     34.0  2.220
                      Siarithria38         384.5  38.0     85.0  3.455
                      Sundim98             111.0  21.0     41.0  4.750

[576 rows x 4 columns]

# DIfferent type for last data missing

In [46]:
avg_purchase_person=pd.DataFrame(groupby_gender_and_sn_df["Price"].sum())

In [47]:
avg_purchase_person.mean()

Price    4.131545
dtype: float64

In [48]:
avg_purchase_person["Avg Total Purchase per Person"]=avg_purchase_person

In [49]:
avg_purchase_person

                                     Price  Avg Total Purchase per Person
Gender                SN
Female                Adastirin33     4.48                           4.48
                      Aerithllora36   8.64                           8.64
                      Aethedru70      3.54                           3.54
                      Aidain51        3.45                           3.45
                      Aiduesu86       4.48                           4.48
...                                    ...                            ...
Other / Non-Disclosed Lirtim36        1.33                           1.33
                      Maluncil97      5.28                           5.28
                      Rairith81       2.22                           2.22
                      Siarithria38    6.91                           6.91
                      Sundim98        4.75                           4.75

[576 rows x 2 columns]

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [50]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [51]:
bins=[0,9,14,19,24,29,34,39,99]
age_range=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [53]:
age_df=purchase_data
age_df["Age_Range"]=pd.cut(age_df["Age"],bins, labels=age_range, include_lowest=True)

In [54]:
age_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [73]:
number_of_players=age_df["SN"].nunique()

In [74]:
print(f"There are {number_of_players} unique players")

There are 576 unique players

In [123]:
number_of_players

576

In [134]:
group_age_df=age_df.groupby("Age_Range").count()

In [136]:
group_age_df

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age_Range
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

In [139]:
group_age_df["Percentage_of_Players"]=(group_age_df["Age"]*100)/number_of_players

In [140]:
group_age_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Percentage_of_Players
Age_Range,,,,,,,,
<10,23,23,23,23,23,23,23,3.993056
10-14,28,28,28,28,28,28,28,4.861111
15-19,136,136,136,136,136,136,136,23.611111
20-24,365,365,365,365,365,365,365,63.368056
25-29,101,101,101,101,101,101,101,17.534722

In [141]:
renamed_group_age_df=group_age_df.rename(columns={"Age":"Total_Count"})
renamed_group_age_df

,Purchase ID,SN,Total_Count,Gender,Item ID,Item Name,Price,Percentage_of_Players
Age_Range,,,,,,,,
<10,23,23,23,23,23,23,23,3.993056
10-14,28,28,28,28,28,28,28,4.861111
15-19,136,136,136,136,136,136,136,23.611111
20-24,365,365,365,365,365,365,365,63.368056
25-29,101,101,101,101,101,101,101,17.534722
30-34,73,73,73,73,73,73,73,12.673611
35-39,41,41,41,41,41,41,41,7.118056
40+,13,13,13,13,13,13,13,2.256944

In [149]:
final_df=renamed_group_age_df[["Total_Count","Percentage_of_Players"]]

In [151]:
final_df["Percentage_of_Players"]=final_df["Percentage_of_Players"].astype(float).map("{:.2f}%".format)

/Users/clementboit/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [152]:
final_df

           Total_Count Percentage_of_Players
Age_Range
<10                 23                 3.99%
10-14               28                 4.86%
15-19              136                23.61%
20-24              365                63.37%
25-29              101                17.53%
30-34               73                12.67%
35-39               41                 7.12%
40+                 13                 2.26%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [153]:
bins=[0,9,14,19,24,29,34,39,99]
age_range=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [154]:
age2_df=purchase_data
age2_df["Age_Range"]=pd.cut(age2_df["Age"],bins, labels=age_range, include_lowest=True)

In [155]:
age2_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [157]:
number_of_purchase=age2_df["Purchase ID"].count()

In [158]:
number_of_purchase

780

# Average pruchase price - code

In [169]:
sum_purchase=age2_df.groupby("Age_Range").mean()

In [170]:
sum_purchase

           Purchase ID        Age     Item ID     Price
Age_Range
<10         435.173913   7.869565  105.565217  3.353478
10-14       361.214286  11.392857   97.107143  2.956429
15-19       403.375000  16.794118   94.102941  3.035956
20-24       382.391781  21.838356   88.589041  3.052219
25-29       406.653465  26.000000   90.376238  2.900990
30-34       359.643836  31.383562   94.054795  2.931507
35-39       404.780488  36.707317  100.902439  3.601707
40+         410.230769  41.538462   89.076923  2.941538

# Purchase Count code

In [159]:
groupby_age2_df=age2_df.groupby("Age_Range").count()

In [160]:
groupby_age2_df

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age_Range
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

# Adding pruchase count to DF

In [171]:
sum_purchase["Purchase_Count"]=groupby_age2_df["Purchase ID"]

In [172]:
sum_purchase

           Purchase ID        Age     Item ID     Price  Purchase_Count
Age_Range
<10         435.173913   7.869565  105.565217  3.353478              23
10-14       361.214286  11.392857   97.107143  2.956429              28
15-19       403.375000  16.794118   94.102941  3.035956             136
20-24       382.391781  21.838356   88.589041  3.052219             365
25-29       406.653465  26.000000   90.376238  2.900990             101
30-34       359.643836  31.383562   94.054795  2.931507              73
35-39       404.780488  36.707317  100.902439  3.601707              41
40+         410.230769  41.538462   89.076923  2.941538              13

# Adding Total Purchase Value to DF

In [173]:
sum_purchase["Total_Purchase_value"]=sum_purchase["Price"]*sum_purchase["Purchase_Count"]

In [175]:
sum_purchase

,Purchase ID,Age,Item ID,Price,Purchase_Count,Total_Purchase_value
Age_Range,,,,,,
<10,435.173913,7.869565,105.565217,3.353478,23,77.13
10-14,361.214286,11.392857,97.107143,2.956429,28,82.78
15-19,403.375000,16.794118,94.102941,3.035956,136,412.89
20-24,382.391781,21.838356,88.589041,3.052219,365,1114.06
25-29,406.653465,26.000000,90.376238,2.900990,101,293.00
30-34,359.643836,31.383562,94.054795,2.931507,73,214.00
35-39,404.780488,36.707317,100.902439,3.601707,41,147.67
40+,410.230769,41.538462,89.076923,2.941538,13,38.24

# Renaming

In [181]:
renamed_df=sum_purchase.rename(columns={"Price": "Average_Purchase_Price"})

In [182]:
renamed_df.columns

Index(['Purchase ID', 'Age', 'Item ID', 'Average_Purchase_Price',
       'Purchase_Count', 'Total_Purchase_value'],
      dtype='object')

In [183]:
final_df2=renamed_df[["Purchase_Count", "Average_Purchase_Price", "Total_Purchase_value"]]

In [185]:
final_df2["Total_Purchase_value"]=final_df2["Total_Purchase_value"].astype(float).map("${:.2f}".format)
final_df2["Average_Purchase_Price"]=final_df2["Average_Purchase_Price"].astype(float).map("${:.2f}".format)

/Users/clementboit/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/Users/clementboit/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [186]:
final_df2

           Purchase_Count Average_Purchase_Price Total_Purchase_value
Age_Range
<10                    23                  $3.35               $77.13
10-14                  28                  $2.96               $82.78
15-19                 136                  $3.04              $412.89
20-24                 365                  $3.05             $1114.06
25-29                 101                  $2.90              $293.00
30-34                  73                  $2.93              $214.00
35-39                  41                  $3.60              $147.67
40+                    13                  $2.94               $38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [187]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

# Calculate Total Purchase value

In [190]:
sum_of_purchase_df=purchase_data.groupby("SN").sum()

In [191]:
sum_of_purchase_df

               Purchase ID  Age  Item ID  Price
SN
Adairialis76           467   16      123   2.28
Adastirin33            142   35      175   4.48
Aeda94                 388   17      128   4.91
Aela59                  28   21      119   4.32
Aelaria33              630   23      171   1.79
...                    ...  ...      ...    ...
Yathecal82            1400   60      241   6.22
Yathedeu43             688   44      143   6.02
Yoishirrala98          572   17      145   4.58
Zhisrisu83             195   20       85   7.89
Zontibe81             1019   63      247   8.03

[576 rows x 4 columns]

# Calculate Average Purchase Price

In [192]:
avg_purchase_player_df=purchase_data.groupby("SN").mean()

In [193]:
avg_purchase_player_df

               Purchase ID   Age     Item ID     Price
SN
Adairialis76    467.000000  16.0  123.000000  2.280000
Adastirin33     142.000000  35.0  175.000000  4.480000
Aeda94          388.000000  17.0  128.000000  4.910000
Aela59           28.000000  21.0  119.000000  4.320000
Aelaria33       630.000000  23.0  171.000000  1.790000
...                    ...   ...         ...       ...
Yathecal82      466.666667  20.0   80.333333  2.073333
Yathedeu43      344.000000  22.0   71.500000  3.010000
Yoishirrala98   572.000000  17.0  145.000000  4.580000
Zhisrisu83       97.500000  10.0   42.500000  3.945000
Zontibe81       339.666667  21.0   82.333333  2.676667

[576 rows x 4 columns]

# Calculate Purchase Count

In [194]:
number_of_purchase_df=purchase_data.groupby("SN").count()

In [195]:
number_of_purchase_df

               Purchase ID  Age  Gender  Item ID  Item Name  Price  Age_Range
SN
Adairialis76             1    1       1        1          1      1          1
Adastirin33              1    1       1        1          1      1          1
Aeda94                   1    1       1        1          1      1          1
Aela59                   1    1       1        1          1      1          1
Aelaria33                1    1       1        1          1      1          1
...                    ...  ...     ...      ...        ...    ...        ...
Yathecal82               3    3       3        3          3      3          3
Yathedeu43               2    2       2        2          2      2          2
Yoishirrala98            1    1       1        1          1      1          1
Zhisrisu83               2    2       2        2          2      2          2
Zontibe81                3    3       3        3          3      3          3

[576 rows x 7 columns]

# add everything to the same DF

In [197]:
sum_of_purchase_df["Average_Purchase_Price"]=avg_purchase_player_df["Price"]
sum_of_purchase_df["Purchase_Count"]=number_of_purchase_df["Purchase ID"]

In [198]:
sum_of_purchase_df

,Purchase ID,Age,Item ID,Price,Average_Purchase_Price,Purchase_Count
SN,,,,,,
Adairialis76,467,16,123,2.28,2.280000,1
Adastirin33,142,35,175,4.48,4.480000,1
Aeda94,388,17,128,4.91,4.910000,1
Aela59,28,21,119,4.32,4.320000,1
Aelaria33,630,23,171,1.79,1.790000,1
...,...,...,...,...,...,...
Yathecal82,1400,60,241,6.22,2.073333,3
Yathedeu43,688,44,143,6.02,3.010000,2
Yoishirrala98,572,17,145,4.58,4.580000,1
Zhisrisu83,195,20,85,7.89,3.945000,2
Zontibe81,1019,63,247,8.03,2.676667,3

In [199]:
renamed_df=sum_of_purchase_df.rename(columns={"Price": "Total_Purchase_value"})

In [200]:
renamed_df.columns

Index(['Purchase ID', 'Age', 'Item ID', 'Total_Purchase_value',
       'Average_Purchase_Price', 'Purchase_Count'],
      dtype='object')

In [205]:
final_df3=renamed_df[["Purchase_Count","Average_Purchase_Price","Total_Purchase_value"]].sort_values(
    ["Purchase_Count"], ascending=False)

In [206]:
final_df3["Average_Purchase_Price"]=final_df3["Average_Purchase_Price"].astype(float).map("${:.2f}".format)
final_df3["Total_Purchase_value"]=final_df3["Total_Purchase_value"].astype(float).map("${:.2f}".format)

In [207]:
final_df3

              Purchase_Count Average_Purchase_Price Total_Purchase_value
SN
Lisosia93                  5                  $3.79               $18.96
Iral74                     4                  $3.40               $13.62
Idastidru52                4                  $3.86               $15.45
Asur53                     3                  $2.48                $7.44
Inguron55                  3                  $3.70               $11.11
...                      ...                    ...                  ...
Hala31                     1                  $1.02                $1.02
Haisurra41                 1                  $4.40                $4.40
Hailaphos89                1                  $3.81                $3.81
Haestyphos66               1                  $1.97                $1.97
Iskosian40                 1                  $3.07                $3.07

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame